In [117]:
import pandas as pd
from sklearn.cluster import MeanShift

In [118]:
df = pd.read_csv("checkins.dat", sep='|')
df.head()

       id  user_id  venue_id   latitude  longitude          created_at
0  984301  2041916      5222        NaN        NaN  2012-04-2117:39:01
1  984222    15824      5222  38.895112 -77.036366  2012-04-2117:43:47
2  984315  1764391      5222        NaN        NaN  2012-04-2117:37:18
3  984234    44652      5222  33.800745 -84.410520  2012-04-2117:43:43
4  984249  2146840      5222        NaN        NaN  2012-04-2117:42:58

In [119]:
df.dtypes

id              int64
user_id         int64
venue_id        int64
latitude      float64
longitude     float64
created_at     object
dtype: object

In [120]:
df = df.dropna()

print(df.shape)

(396634, 6)

In [121]:
df = df[['latitude', 'longitude']][:100000]

df.head()

     latitude   longitude
1   38.895112  -77.036366
3   33.800745  -84.410520
7   45.523452 -122.676207
9   40.764462 -111.904565
10  33.448377 -112.074037

In [33]:
ms = MeanShift(bandwidth=0.1, n_jobs = -1)
ms.fit(df)

MeanShift(bandwidth=0.1, bin_seeding=False, cluster_all=True, min_bin_freq=1,
     n_jobs=-1, seeds=None)

In [122]:
labels = ms.labels_
cluster_centers = ms.cluster_centers_
df['label'] = labels
df.head()

     latitude   longitude  label
1   38.895112  -77.036366      5
3   33.800745  -84.410520      7
7   45.523452 -122.676207     30
9   40.764462 -111.904565     65
10  33.448377 -112.074037      1

In [123]:
labels_big_idx = df.groupby(['label'])['label'].count().where(lambda x: x > 15).dropna().index
labels_big_idx

Int64Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
            ...
             595,  618,  635,  648,  661,  691,  739,  897, 1325, 1416],
           dtype='int64', name='label', length=592)

In [124]:
clusters_big = clusters[labels_big_idx]
clusters_big[0]

array([ 40.7177164 , -73.99183542])

In [125]:
officies = [[33.751277, -118.188740], [25.867736, -80.324116], [51.503016, -0.075479],\
            [52.378894, 4.885084], [39.366487, 117.036146], [-33.868457, 151.205134]]

In [116]:
import math

def distance(lat1, lat2, lon1, lon2):
    return math.hypot(lat2 - lat1, lon2 - lon1)
    

def min_distance(center_lat, center_lon):
    return min([distance(center_lat, of[0], center_lon, of[1]) for of in officies])


res = [(cl, min_distance(cl[0], cl[1])) for cl in clusters_big]
res.sort(key=lambda x: x[1])
res[:1]

[(array([ -33.86063043,  151.20477593]), 0.007834758163107856)]